Tekla Open API Reference for Tekla Structures 2025
GraphicObjectAttributes Properties
The GraphicObject.GraphicObjectAttributes type exposes the following members.
Properties
Name | Description
Line
 The line attributes of the graphic object. A graphic object always consists of lines.
Top
See Also
Reference
GraphicObject.GraphicObjectAttributes Class
Tekla.Structures.Drawing Namespace